function main(item) {
// 酷9壳 JS专用 适用于1.3.4版本及以后
// 仅限安徽联通内网使用，可回放&时移
// 使用方式 http://PLTV/ku9/js/AHunicom.js?id=CCTV-1 综合
    let url = item.url;
    const id = ku9.getQuery( url, "id" );
    const playseek = ku9.getQuery( url, "playseek" );
    
     // 定义频道ID与UUID的映射关系
    const n = {
    	//第一个参数，哪种链接头；第二个参数，末尾标志ID
    	//央视
        'CCTV-1 综合': [0,"152"], // CCTV-1 综合 
        'CCTV-2 财经': [0,"477"], // CCTV-2 财经
        'CCTV-3 综艺': [0,"487"], // CCTV-3 综艺
        'CCTV-4 中文国际': [0,"573"], // CCTV-4 中文国际
        'CCTV-5 体育': [0,"481"], // CCTV-5 体育
        'CCTV-5+ 体育赛事': [0,"153"], // CCTV-5+ 体育赛事
        'CCTV-6 电影': [2,"005"], // CCTV-6 电影
        'CCTV-7 国防军事': [0,"485"], // CCTV-7 国防军事
        'CCTV-8 电视剧': [0,"476"], // CCTV-8 电视剧
        'CCTV-9 纪录': [0,"478"], // CCTV-9 纪录
        'CCTV-10 科教': [0,"480"], // CCTV-10 科教
        'CCTV-11 戏曲': [0,"583"], // CCTV-11 戏曲
        'CCTV-12 社会与法': [0,"482"], // CCTV-12 社会与法
        'CCTV-13 新闻': [0,"602"], // CCTV-13 新闻
        'CCTV-14 少儿': [0,"483"], // CCTV-14 少儿
        'CCTV-15 音乐': [0,"587"], // CCTV-15 音乐
        'CCTV-16 奥林匹克': [0,"625"], // CCTV-16 奥林匹克
        'CCTV-17 农业农村': [0,"580"], // CCTV-17 农业农村
        'CGTN': [0,"148"], // CGTN

        //卫视频道
        '安徽卫视': [0,"039"], // 安徽卫视
        '北京卫视': [0,"194"], // 北京卫视
        '东方卫视': [4,"263"], // 东方卫视
        '广东卫视': [0,"445"], // 广东卫视
        '深圳卫视': [0,"197"], // 深圳卫视
        '湖南卫视': [0,"195"], // 湖南卫视
        '湖北卫视': [0,"267"], // 湖北卫视
        '浙江卫视': [0,"265"], // 浙江卫视
        '江苏卫视': [0,"198"], // 江苏卫视
        '东南卫视': [0,"588"], // 东南卫视
        '天津卫视': [0,"266"], // 天津卫视
        '河北卫视': [0,"575"], // 河北卫视
        '山东卫视': [0,"470"], // 山东卫视
        '贵州卫视': [0,"577"], // 贵州卫视
        '辽宁卫视': [0,"472"], // 辽宁卫视
        '甘肃卫视': [0,"603"], // 甘肃卫视
        '吉林卫视': [0,"619"], // 吉林卫视
        '海南卫视': [5,"003"], // 海南卫视
        '重庆卫视': [0,"083"], // 重庆卫视
        '广西卫视': [0,"086"], // 广西卫视
        '云南卫视': [0,"060"], // 云南卫视
        '四川卫视': [0,"069"], // 四川卫视
        '陕西卫视': [0,"090"], // 陕西卫视
        '山西卫视': [0,"099"], // 山西卫视
        '厦门卫视': [4,"244"], // 厦门卫视
        '三沙卫视': [0,"589"], // 三沙卫视
        '青海卫视': [0,"096"], // 青海卫视
        '宁夏卫视': [0,"640"], // 宁夏卫视
        '江西卫视': [0,"065"], // 江西卫视
        '河南卫视': [0,"085"], // 河南卫视
        '兵团卫视': [0,"642"], // 兵团卫视
        '新疆卫视': [0,"641"], // 新疆卫视
        '西藏卫视': [0,"639"], // 西藏卫视
      '内蒙古卫视': [0,"098"], // 内蒙古卫视
      '黑龙江卫视': [0,"196"], // 黑龙江卫视

        //安徽频道
        '安徽影视': [7,"007"], // 安徽影视
        '安徽国际': [7,"015"], // 安徽国际
        '安徽公共': [7,"009"], // 安徽公共
        '安徽经济生活': [7,"005"], // 安徽经济生活
        '安徽综艺·体育': [7,"011"], // 安徽综艺·体育
        '安徽农业·科教': [7,"013"], // 安徽农业·科教
        '池州新闻综合': [8,"089"], // 池州新闻综合
        '池州文教生活': [8,"087"], // 池州文教生活
        '安庆新闻综合': [8,"111"], // 安庆新闻综合
        '安庆经济生活': [8,"109"], // 安庆经济生活
        '宿州新闻综合': [8,"099"], // 宿州新闻综合
        '宿州科教生活': [8,"097"], // 宿州科教生活
        '六安综合': [8,"125"], // 六安综合
        '六安社会生活': [8,"123"], // 六安社会生活
        '黄山新闻综合': [8,"117"], // 黄山新闻综合
        '黄山文旅频道': [8,"115"], // 黄山文旅频道
        '淮南新闻综合': [8,"105"], // 淮南新闻综合
        '淮北新闻综合': [8,"119"], // 淮北新闻综合
        '淮北经济生活': [8,"121"], // 淮北经济生活
        '滁州新闻综合': [8,"081"], // 滁州新闻综合
        '滁州科教频道': [8,"085"], // 滁州科教频道
        '滁州公共频道': [8,"083"], // 滁州公共频道
        '蚌埠新闻': [8,"077"], // 蚌埠新闻
        '蚌埠生活': [8,"079"], // 蚌埠生活
        '亳州综合频道': [8,"075"], // 亳州综合频道
        '亳州农村频道': [9,"033"], // 亳州农村频道
        '马鞍山新闻综合': [10,"015"], // 马鞍山新闻综合
        '马鞍山科教生活': [3,"001"], // 马鞍山科教生活

        //4K超高清
        '北京卫视4K': [0,"633"], // 北京卫视4K
        '广东卫视4K': [0,"636"], // 广东卫视4K
        '深圳卫视4K': [0,"638"], // 深圳卫视4K
        '东方卫视4K': [0,"654"], // 东方卫视4K
        '江苏卫视4K': [0,"648"], // 江苏卫视4K
        '浙江卫视4K': [0,"650"], // 浙江卫视4K
        '湖南卫视4K': [0,"645"], // 湖南卫视4K
        '四川卫视4K': [0,"643"], // 四川卫视4K
        '山东卫视4K': [0,"652"], // 山东卫视4K

        //数字频道
        'CCTV-第一剧场': [1,"039"], // CCTV-第一剧场
        'CCTV-怀旧剧场': [1,"043"], // CCTV-怀旧剧场
        'CCTV-风云剧场': [1,"041"], // CCTV-风云剧场
        'CCTV-风云音乐': [1,"037"], // CCTV-风云音乐
        'CCTV-兵器科技': [1,"053"], // CCTV-兵器科技
        'CCTV-女性时尚': [1,"055"], // CCTV-女性时尚
        'CCTV-风云足球': [1,"051"], // CCTV-风云足球
        'CCTV-央视台球': [1,"047"], // CCTV-央视台球
        'CCTV-高尔夫·网球': [1,"049"], // CCTV-高尔夫·网球
        'CCTV-央视文化精品': [1,"057"], // CCTV-央视文化精品
        '欢笑剧场': [6,"005"], // 欢笑剧场
        '金鹰纪实': [0,"569"], // 金鹰纪实
        '金鹰卡通': [0,"151"], // 金鹰卡通
        '快乐垂钓': [11,"d7a"], // 金鹰纪实
        '茶频道': [12,"8de"], // 金鹰卡通
        '卡酷少儿': [0,"150"], // 卡酷少儿
        '嘉佳卡通': [0,"448"], // 嘉佳卡通
        '财富天下': [0,"183"], // 财富天下
        'CETV-1': [0,"463"], // CETV-1
        'CETV-2': [4,"251"], // CETV-2
        'CETV-4': [4,"252"], // CETV-4
        '山东教育卫视': [4,"248"], // 山东教育卫视
    };
    //定义链接头，安徽联通目前有6种
    const liveUrlHeader = [
       //0 大多数频道
       "http://10.255.126.3:8006/AHBKLIVE/00000001000000050000000000000",
       //1 兵器科技 风云系列 剧场系列 文化精品 高尔夫 台球等
       "http://10.255.126.3:8006/AHBKLIVE/11111120210421000000000000000",
       //2 cctv-6
       "http://10.255.126.3:8006/AHBKLIVE/11111120220816000000000000000",
       //3 cctv-16 改为正常0
       "http://10.255.126.3:8006/AHBKLIVE/11111120211027000000000000000",
       //4 东方卫视
       "http://10.255.126.3:8006/AHBKLIVE/00005000000000000000000000000",
       //5 海南卫视
       "http://10.255.126.3:8006/AHBKLIVE/12000000000000000000000000000",
       //6 欢笑剧场
       "http://10.255.126.3:8006/AHBKLIVE/11111120240912000000000000000",
       //7 安徽影视
       "http://10.255.126.3:8006/AHBKLIVE/11111100000000000000000000000",
       //8 池州新闻综合
       "http://10.255.126.3:8006/AHBKLIVE/11111120210510000000000000000",
       //9 亳州农村频道
       "http://10.255.126.3:8006/AHBKLIVE/11111120210408000000000000000",
       //10 马鞍山新闻综合
       "http://10.255.126.3:8006/AHBKLIVE/11111120211018000000000000000",
       //11 快乐垂钓
       "http://10.255.126.3:8006/AHBKLIVE/4d0ec3c7a7cf41458ce3c7e241f7e",
       //12 茶频道
       "http://10.255.126.3:8006/AHBKLIVE/ccfffb202e2e4795b85241af37abc",

    ];
        
    if (!n[id]) {
         return JSON.stringify({error: '未知的频道ID: ' + id});
    }
    let idHeader = n[id][0];
    let liveUrl = liveUrlHeader[idHeader] + n[id][1];
    
    
    let finalUrl;
    if (!playseek) {
        finalUrl = liveUrl;
    } else {
        //let time =  playseek + "9";
        //let starttime = time.slice(0,14);
        //let endtime = time.slice(15,29);
        finalUrl = liveUrl + "?playseek=" + playseek;
        // + "&starttime=" + starttime + "&endtime=" + endtime;
    }
       
                  
    return JSON.stringify({url:finalUrl});
}





